package sololean;

public class SoloLean {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}

/*

int: 정수를 나타내는 데이터 타입입니다. Java에서는 32비트의 크기를 가지며, 약 -2,147,483,648부터 2,147,483,647까지의 정수 값을 저장할 수 있습니다. 예를 들어, int age = 30;과 같이 사용됩니다.

long: int보다 큰 정수를 나타내는 데이터 타입입니다. Java에서는 64비트의 크기를 가지며, 약 -9,223,372,036,854,775,808부터 9,223,372,036,854,775,807까지의 정수 값을 저장할 수 있습니다. 사용 시에는 long population = 7000000000L;과 같이 접미사 L 또는 l을 붙여야 합니다.

boolean: 참(true) 또는 거짓(false) 값을 나타내는 데이터 타입입니다. 조건문과 논리 연산자에서 주로 사용됩니다. 예를 들어, boolean isRaining = true;와 같이 사용됩니다.

double: 실수를 나타내는 데이터 타입입니다. Java에서는 64비트의 크기를 가지며, 대략적인 범위와 정밀도를 제공합니다. 예를 들어, double pi = 3.14159;와 같이 사용됩니다.

float: double보다 작은 실수를 나타내는 데이터 타입입니다. Java에서는 32비트의 크기를 가지며, float 타입 변수를 선언할 때는 접미사 F 또는 f를 붙여야 합니다. 예를 들어, float temperature = 26.5f;와 같이 사용됩니다.

char: 문자를 나타내는 데이터 타입입니다. Java에서는 16비트의 크기를 가지며, 작은따옴표(')로 문자를 감싸서 표현합니다. 예를 들어, char grade = 'A';와 같이 사용됩니다.

byte: 매우 작은 정수를 나타내는 데이터 타입으로, Java에서는 8비트의 크기를 가지며, -128부터 127까지의 값을 저장할 수 있습니다. 예를 들어, byte num = 10;과 같이 사용됩니다.
*/
